people/nguyenthanhvuh/old/org/badminton_new_mexico.org
#+TITLE: Badminton in Albuquerque, New Mexico
#+date: <2022-02-28 Mon>
#+description: Badminton in Albuquerque, NM
#+filetags: blog miscs

I am longer in NM but still got lots of emails from people asking about badminton information. So here are some information:

- Johnson gym (UNM): people play badminton at Johnson gym very often. I don't know their exact schedule but usually it is on Friday evening (around 7) and Sunday afternoon (around 2).  There is no membership fee, but you need to pay or be a member to enter Johnson center.

- Also, there is a group that plays at Manzano Mesa Multicultural Center every Tuesday and Thursday from 6 to 8 pm (not sure if they have changed this).
  
