people/nguyenthanhvuh/old/posts/badminton_new_mexico.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="description" content="Badminton in Albuquerque, NM">
<link rel="alternate"
      type="application/rss+xml"
      href="./rss.xml"
      title="RSS feed for ./">
<title>Badminton in Albuquerque, New Mexico</title>
<meta name="author" content="ThanhVu Nguyen">
<meta name="referrer" content="no-referrer">
<link rel="stylesheet" type="text/css" href="https://dynaroars.github.io/files/org.css" />
<link href= "../files/org-orig.css" rel="stylesheet" type="text/css" /> 
<link rel="icon" href="../files/favicon.ico">
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="../index.html">ThanhVu Nguyen</a>,  
  <a href="index.html">Archive</a>
</div>
</div>
<div id="content">
<div class="post-date">27 Feb 2022</div><h1 class="post-title"><a href="./badminton_new_mexico.html">Badminton in Albuquerque, New Mexico</a></h1>
<p>
I am longer in NM but still got lots of emails from people asking about badminton information. So here are some information:
</p>

<ul class="org-ul">
<li>Johnson gym (UNM): people play badminton at Johnson gym very often. I don't know their exact schedule but usually it is on Friday evening (around 7) and Sunday afternoon (around 2).  There is no membership fee, but you need to pay or be a member to enter Johnson center.</li>

<li>Also, there is a group that plays at Manzano Mesa Multicultural Center every Tuesday and Thursday from 6 to 8 pm (not sure if they have changed this).</li>
</ul>
<div class="taglist"><a href="./tags.html">Tags</a>: <a href="./tag-blog.html">blog</a> <a href="./tag-miscs.html">miscs</a> </div></div>
<div id="postamble" class="status"><!-- <div id="archive"><a href="archive.html">Other posts</a></div>  -->
</div>
</body>
</html>
